hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzp_device.c
    @param tx_packet is a pointer to the packet to be sent.
    @param length is the length of the packet to be sent.

    @retval true if transmission succeeded and packet was decrypted correctly by host.
    @retval false if transmission failed or packet was not decrypted correctly by host.
*/
static bool gzp_crypt_tx_transaction(const uint8_t *tx_packet, uint8_t length);

/**
    Function updateing the "dynamic key" and sending a "key update" to the host.

    @retval true if key update succeeded.
    @retval false if if key update failed.
*/
static bool gzp_key_update(void);

/**
    Function for adding an element to "parameters data base" in non volatile (NV) memory. An element is
    GZP_PARAMS_ELEMENT_SYSTEM_ADDRESS bytes long, holding the "system address" and  "host ID".

    The "parameters data base" can store up to GZP_DEVICE_PAIRING_PARAMS_DB_MAX_ENTRIES
    elements.

    @param src_element is a pointer to the element.
    @param index is a number between 0 and (GZP_PARAMS_DB_MAX_ENTRIES - 1)
    selecting the location in which the element will be stored.
*/
static void gzp_params_db_add(const uint8_t *src_element, uint8_t index);

/**
    Function for reading an element from "parameters data base" in non volatile (NV) memory. An element is
    GZP_PARAMS_ELEMENT_SYSTEM_ADDRESS bytes long, holding the "system address" and  "host ID".

    @param dst_element is a pointer where the read element should be stored.
    @param index is a number between 0 and (GZP_PARAMS_DB_MAX_ENTRIES - 1).
    selecting the location that should be read.
*/
static void gzp_params_db_read(uint8_t *dst_element, uint8_t index);

/**
    Function for writing an index to the "index data base" in non volatile (NV) memory.

    @param index is the index to be written to the data base.
*/
static void gzp_index_db_add(uint8_t index);

/**
    Function for reading the index previously written to the "index data base" in NV memory.

    @return
*/
static uint8_t gzp_index_db_read(void);

/**
    Check "index data base" is full.

    @retval true
    @retval false
*/
static bool gzp_index_db_full(void);

/**
    Function returning @b true if the "index data base" is empty.

    @retval true
    @retval false
*/
static bool gzp_index_db_empty(void);

/**
    Function returning @b true if array contains only 1s (0xff).

    @param *src is a pointer to the array to be evaluated.
    @param length is the length of the array to be evaluated.

    @retval true
    @retval false
*/
static bool gzp_array_is_set(const uint8_t *src, uint8_t length);

/**
    Function for storing the current "system address" and "host ID" in NV memory.

    @param store_all selects whether only "system address" or both "system address" and
                    "host ID" should be stored.
    @arg true selects that both should be stored.
    @arg false selects that only "system address" should be stored.

    @retval true
    @retval false
*/
static bool gzp_params_store(bool store_all);

/**
    Restore the "system address" and "host ID" from NV memory.
    @retval true
    @retval false
*/
static bool gzp_params_restore(void);

/**
    Delay function. Will add a delay equal to GZLL_RX_PERIOD * rx_periods [us].

    @param rx_periods
*/
void gzp_delay_rx_periods(uint32_t rx_periods);

/**
    Delay function. Will add a delay equal to GZLL_RX_PERIOD * rx_periods [us] using the
    gazell timer and not a delay loop.

    @param rx_periods
*/
void gzp_tick_sleep_rx_periods(uint32_t rx_periods);

/*
    Print debug string. By default does nothing.

    If GZP_DEBUG is defined then the print string function is required to
    be implemented.
*/
void print_string(char *p_expr);

/** @} */

/******************************************************************************/
/** @name Internal (static) variables
    @{ */
/******************************************************************************/

static nrf_gzll_device_tx_info_t latest_tx_info;  ///< Information about the last TX attempt, e.g. RSSI of ACK.

static volatile bool tx_complete; ///< Flag to indicate whether a GZLL TX attempt has completed.
static bool tx_success;  ///< Flag to indicate whether a GZLL TX attempt was successful.

// Define Macro to make array initialization nicer
#define REP4(X) X X X X

#if defined(__ICCARM__)
    #if GZP_PARAMS_DB_ADR == 0x1000
        static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] @ "gzp_dev_data"
    #elif GZP_PARAMS_DB_ADR == 0x15000
        static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] @ "gzp_dev_data_sd"
    #else
        #error
    #endif
#else
    static const uint32_t database[GZP_DEVICE_PARAMS_STORAGE_SIZE / 4] __attribute__((at(GZP_PARAMS_DB_ADR)))
#endif
=
{
#define STATIC_INIT_VALUE    0xFFFFFFFF
#define STATIC_INIT_COUNT    (GZP_DEVICE_PARAMS_STORAGE_SIZE / 4)
#define INIT_1 STATIC_INIT_VALUE,
#define INIT_4 REP4(INIT_1)
#define INIT_16 REP4(INIT_4)
#define INIT_64 REP4(INIT_16)
#define INIT_256 REP4(INIT_64)
#define INIT_1024 REP4(INIT_256)

    #if (STATIC_INIT_COUNT == 256)
    INIT_256
    #elif (STATIC_INIT_COUNT == 1024)
    INIT_1024
    #else
#error Gazell Pairing Library database not initialized properly!
    #endif
}; ///< Database for storing keys.


/** @} */


/******************************************************************************/
// Implementation: Device-specific API functions
/******************************************************************************/


void gzp_init()
{
    gzp_id_req_pending = false;
    
    #ifndef GZP_NV_STORAGE_DISABLE
    (void)gzp_params_restore();
    #endif
    
    // Update radio parameters from gzp_system_address
    (void)gzp_update_radio_params(gzp_system_address);
}


void gzp_erase_pairing_data(void)
{
    // Erase database flash page so that it can be later written to.
    nrf_nvmc_page_erase((uint32_t)database);
}

bool gzp_address_req_send()
{
    //lint -save -e514 Unusual use of a Boolean expression (gzll_update_ok &= ...)
    uint8_t i;
    bool retval = false;
    bool success;
    uint8_t address_req[GZP_CMD_HOST_ADDRESS_REQ_PAYLOAD_LENGTH];
    uint8_t rx_payload[NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH];
    uint32_t rx_payload_length =  NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;
    nrf_gzll_tx_power_t temp_power;
    uint32_t temp_max_tx_attempts;
    bool gzll_update_ok = true;
    
    
    // Store parameters that are temporarily changed
    temp_max_tx_attempts = nrf_gzll_get_max_tx_attempts();
    temp_power = nrf_gzll_get_tx_power();
    
    // Modify parameters
    nrf_gzp_disable_gzll();
    nrf_gzll_set_max_tx_attempts(GZP_REQ_TX_TIMEOUT);
    gzll_update_ok &= nrf_gzll_set_tx_power(GZP_POWER);
    
    // Flush RX FIFO
    gzll_update_ok &= nrf_gzll_flush_rx_fifo(GZP_PAIRING_PIPE);
    gzll_update_ok &= nrf_gzll_enable();
    // Build "request" packet
    address_req[0] = (uint8_t)GZP_CMD_HOST_ADDRESS_REQ;
    
    // Send a number of packets in order to broadcast that devices not within
    // close proximity must back off.
    for(i = 0; i < GZP_MAX_BACKOFF_PACKETS; i++)
    {
        success = gzp_tx_packet(address_req, GZP_CMD_HOST_ADDRESS_REQ_PAYLOAD_LENGTH, GZP_PAIRING_PIPE);
        
        if(success)
            nrf_gzp_flush_rx_fifo(GZP_PAIRING_PIPE);
            
        else
            break;
    }
    
    gzp_delay_rx_periods(GZP_TX_ACK_WAIT_TIMEOUT);
    // Send message for fetching pairing response from host.
    address_req[0] = (uint8_t)GZP_CMD_HOST_ADDRESS_FETCH;
    
    success =  gzp_tx_packet(address_req, GZP_CMD_HOST_ADDRESS_REQ_PAYLOAD_LENGTH, GZP_PAIRING_PIPE);
    
    if(success  && latest_tx_info.payload_received_in_ack)
    {
        // If pairing response received
        if(nrf_gzll_get_rx_fifo_packet_count(GZP_PAIRING_PIPE) > 0)
        {
            rx_payload_length = NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH;  //dummy placeholder
            
