hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzp_device.c
static uint8_t gzp_index_db_read()
{
    uint8_t retval;
    int16_t i;
    
    // Search for previously written location
    for(i = (GZP_INDEX_DB_SIZE - 1); i >= 0; i--)
    {
        retval = *(uint8_t *)(GZP_INDEX_DB_ADR + i);
        
        if(retval != 0xff)
            break;
    }
    
    if(retval == 0xff)
    {
        retval = GZP_PARAMS_DB_MAX_ENTRIES;  // index db empty
    }
    
    else if((retval & 0xf0) != 0xf0)
        retval >>= 4;
        
    else
        retval &= 0x0f;
        
    return retval;
}

int8_t gzp_get_pairing_status(void)
{
    uint8_t db_byte;
    int8_t db_index;
    int16_t i;
    uint8_t temp_element[GZP_PARAMS_DB_ELEMENT_SIZE];
    uint8_t default_host_id[GZP_HOST_ID_LENGTH];
    
    db_index = -2;
    
    // Populate default Host ID with F's.
    for(i = 0; i < GZP_HOST_ID_LENGTH; i++)
        default_host_id[i] = 0xFF;
        
    // Search for previously written location
    for(i = (GZP_INDEX_DB_SIZE - 1); i >= 0; i--)
    {
        db_byte = *(uint8_t *)(GZP_INDEX_DB_ADR + i);
        
        // Check if idx has been written to
        if(db_byte != 0xff)
        {
            // Convert 4-bit nibble to index
            if((db_byte & 0xf0) != 0xf0)
                db_byte = (db_byte >> 4) & 0x0f;
                
            else
                db_byte = db_byte & 0x0f;
                
            // Retrieve database entry
            gzp_params_db_read(temp_element, db_byte);
            
            // Check if database entry is all F's
            if(memcmp(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], default_host_id, GZP_HOST_ID_LENGTH) != 0)
            
                db_index = db_byte;
                
            else
                db_index = -1;
                
            break;
        }
    }
    
    return db_index;
}


static bool gzp_index_db_full()
{
    #if (GZP_INDEX_DB_SIZE != 0)
    return ((*(uint8_t *)(GZP_INDEX_DB_ADR + (GZP_INDEX_DB_SIZE - 1)) != 0xff));
    #else
    return true;
    #endif
}

//lint -save -e506 Constant value boolean
static bool gzp_index_db_empty()
{
    #if (GZP_INDEX_DB_SIZE != 0)
    return ((GZP_INDEX_DB_SIZE == 0) || ((*(uint8_t *)(GZP_INDEX_DB_ADR)) == 0xff));
    #else
    return true;
    #endif
}
//lint -restore

static bool gzp_array_is_set(const uint8_t *src, uint8_t length)
{
    uint8_t i;
    
    for(i = 0; i < length; i++)
    {
        if(*(src++) != 0xff)
            return false;
    }
    
    return true;
}

static bool gzp_params_store(bool store_all)
{
    uint8_t i;
    bool write_index_db = false;
    bool write_param_db = false;
    uint8_t new_db_index = 0;
    uint8_t temp_element[GZP_PARAMS_DB_ELEMENT_SIZE];
    
    // Search param DB to see if current setup exists
    if(store_all)
    {
        // Search for: Current system address and host ID exists
        for(i = 0; i < GZP_PARAMS_DB_MAX_ENTRIES; i++)
        {
            gzp_params_db_read(temp_element, i);
            
            if(((memcmp(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], gzp_system_address, GZP_SYSTEM_ADDRESS_WIDTH)) == 0)
               && ((memcmp(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], gzp_host_id, GZP_HOST_ID_LENGTH)) == 0))
            {
                write_index_db = true;
                new_db_index = i;
                break; // System address + host_id allready exists in database
            }
        }
        
        // Search for: Current system address and cleared host ID
        if(!write_index_db)
        {
            for(i = 0; i < GZP_PARAMS_DB_MAX_ENTRIES; i++)
            {
                gzp_params_db_read(temp_element, i);
                
                if(((memcmp(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], gzp_system_address, GZP_SYSTEM_ADDRESS_WIDTH)) == 0) && \
                   (gzp_array_is_set(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], GZP_HOST_ID_LENGTH)))
                {
                    memcpy(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], gzp_host_id, GZP_HOST_ID_LENGTH);
                    new_db_index = i;
                    write_index_db = true;
                    write_param_db = true;
                    break;
                }
            }
        }
        
        // Search for: Cleared system address and cleared host ID
        if(!write_index_db)
        {
            for(i = 0; i < GZP_PARAMS_DB_MAX_ENTRIES; i++)
            {
                gzp_params_db_read(temp_element, i);
                
                if(gzp_array_is_set(temp_element, GZP_PARAMS_DB_ELEMENT_SIZE))
                {
                    memcpy(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], gzp_system_address, GZP_SYSTEM_ADDRESS_WIDTH);
                    memcpy(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], gzp_host_id, GZP_HOST_ID_LENGTH);
                    new_db_index = i;
                    write_index_db = true;
                    write_param_db = true;
                    break;
                }
            }
        }
    }
    
    else
    {
        // Search for: System address + any host ID
        for(i = 0; i < GZP_PARAMS_DB_MAX_ENTRIES; i++)
        {
            gzp_params_db_read(temp_element, i);
            
            if((memcmp(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], gzp_system_address, GZP_SYSTEM_ADDRESS_WIDTH)) == 0)
            {
                //memcpy(&temp_element[GZP_PARAMS_DB_ELEMENT_HOST_ID], gzp_host_id, GZP_HOST_ID_LENGTH);
                write_index_db = true;
                new_db_index = i;
                break;
            }
        }
        
        // Search for: System address cleared
        if(!write_index_db)
        {
            for(i = 0; i < GZP_PARAMS_DB_MAX_ENTRIES; i++)
            {
                gzp_params_db_read(temp_element, i);
                
                if(gzp_array_is_set(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], GZP_SYSTEM_ADDRESS_WIDTH))
                {
                    memcpy(&temp_element[GZP_PARAMS_DB_ELEMENT_SYSTEM_ADDRESS], gzp_system_address, GZP_SYSTEM_ADDRESS_WIDTH);
                    write_index_db = true;
                    write_param_db = true;
                    new_db_index = i;
                    break;
                }
            }
        }
    }
    
